#### Terraform Format and Style 🖌`failure`
#### alpha - Terraform Initialization ⚙️`success`
#### alpha - Terraform Validation 🤖Success! The configuration is valid.


#### alpha - Terraform Plan 📖`success`

<details><summary>alpha - Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.core-infrastructure.module.k8s-master.data.google_project.project: Refreshing state... [id=projects/terra-datarepo-alpha]
module.core-infrastructure.module.k8s-master.data.google_container_engine_versions.cluster_versions: Refreshing state... [id=2020-12-08 15:23:17.298413984 +0000 UTC]
module.enable-services.google_project_service.cloudresourcemanager[0]: Refreshing state... [id=terra-datarepo-alpha/cloudresourcemanager.googleapis.com]
module.core-infrastructure.module.cloud-armor.google_compute_security_policy.policy: Refreshing state... [id=projects/terra-datarepo-alpha/global/securityPolicies/broad-cloud-armor]
module.core-infrastructure.google_compute_ssl_policy.global-ssl-policy: Refreshing state... [id=projects/terra-datarepo-alpha/global/sslPolicies/global-ssl-policy]
module.enable-services.google_project_service.serviceusage[0]: Refreshing state... [id=terra-datarepo-alpha/serviceusage.googleapis.com]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo"]: Refreshing state... [id=aSD7KqGHxMSyFzonU_-vVA]
module.datarepo-app.module.cloudsql.random_id.cloudsql_id[0]: Refreshing state... [id=ZrUTW1MjlVw]
module.datarepo-app.module.cloudsql.random_id.root_user_password[0]: Refreshing state... [id=4QU0qQ1b9O7mxK6_dgfFww]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo-stairway"]: Refreshing state... [id=QUxyb72Vy09NqFV4S6907g]
module.core-infrastructure.module.k8s-nodes["jade-node-us-central-1"].google_container_node_pool.pool: Refreshing state...
module.enable-services.google_project_service.required-services[10]: Refreshing state... [id=terra-datarepo-alpha/container.googleapis.com]
module.enable-services.google_project_service.required-services[14]: Refreshing state... [id=terra-datarepo-alpha/stackdriver.googleapis.com]
module.enable-services.google_project_service.required-services[0]: Refreshing state... [id=terra-datarepo-alpha/iamcredentials.googleapis.com]
module.enable-services.google_project_service.required-services[12]: Refreshing state... [id=terra-datarepo-alpha/storage-component.googleapis.com]
module.enable-services.google_project_service.required-services[15]: Refreshing state... [id=terra-datarepo-alpha/logging.googleapis.com]
module.enable-services.google_project_service.required-services[3]: Refreshing state... [id=terra-datarepo-alpha/genomics.googleapis.com]
module.enable-services.google_project_service.required-services[9]: Refreshing state... [id=terra-datarepo-alpha/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[1]: Refreshing state... [id=terra-datarepo-alpha/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[13]: Refreshing state... [id=terra-datarepo-alpha/servicenetworking.googleapis.com]
module.enable-services.google_project_service.required-services[11]: Refreshing state... [id=terra-datarepo-alpha/storage-api.googleapis.com]
module.enable-services.google_project_service.required-services[5]: Refreshing state... [id=terra-datarepo-alpha/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[8]: Refreshing state... [id=terra-datarepo-alpha/monitoring.googleapis.com]
module.enable-services.google_project_service.required-services[7]: Refreshing state... [id=terra-datarepo-alpha/sql-component.googleapis.com]
module.enable-services.google_project_service.required-services[4]: Refreshing state... [id=terra-datarepo-alpha/compute.googleapis.com]
module.enable-services.google_project_service.required-services[6]: Refreshing state... [id=terra-datarepo-alpha/dns.googleapis.com]
module.enable-services.google_project_service.required-services[2]: Refreshing state... [id=terra-datarepo-alpha/serviceusage.googleapis.com]
module.core-infrastructure.google_compute_address.nat-address[0]: Refreshing state... [id=projects/terra-datarepo-alpha/regions/us-central1/addresses/nat-external-0]
module.core-infrastructure.google_compute_network.network[0]: Refreshing state... [id=projects/terra-datarepo-alpha/global/networks/alpha-network]
module.core-infrastructure.google_compute_address.nat-address[1]: Refreshing state... [id=projects/terra-datarepo-alpha/regions/us-central1/addresses/nat-external-1]
module.core-infrastructure.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=projects/terra-datarepo-alpha/regions/us-central1/subnetworks/alpha-subnet]
module.core-infrastructure.google_compute_router.router[0]: Refreshing state... [id=projects/terra-datarepo-alpha/regions/us-central1/routers/router]
module.core-infrastructure.module.k8s-master.google_container_cluster.cluster: Refreshing state... [id=projects/terra-datarepo-alpha/locations/us-central1/clusters/jade-master-us-central1]
module.core-infrastructure.google_compute_router_nat.nat[0]: Refreshing state... [id=terra-datarepo-alpha/us-central1/router/nat-1]
module.core-infrastructure.module.k8s-nodes["jade-node-us-central-1"].google_container_node_pool.pool: Refreshing state... [id=projects/terra-datarepo-alpha/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-1]
module.datarepo-app.module.workloadid.google_service_account.user-sql-service-account["alpha"]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/alpha-workload-proxy-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_service_account.datarepo_test_runner_sa[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_compute_global_address.global_ip_address: Refreshing state... [id=projects/terra-datarepo-alpha/global/addresses/jade-alpha-ip]
module.datarepo-app.module.cloudsql.google_compute_global_address.private_ip_address[0]: Refreshing state... [id=projects/terra-datarepo-alpha/global/addresses/datarepo-db-jade-private-address]
module.datarepo-app.google_service_account.datarepo_sql_sa[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-sql@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_service_account.datarepo_api_sa[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.google_service_networking_connection.private_vpc_connection[0]: Refreshing state... [id=https%3A%2F%2Fwww.googleapis.com%2Fcompute%2Fv1%2Fprojects%2Fterra-datarepo-alpha%2Fglobal%2Fnetworks%2Falpha-network:servicenetworking.googleapis.com]
module.datarepo-app.module.workloadid.google_service_account_key.user-sql-sa-key["alpha"]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/alpha-workload-proxy-sa@terra-datarepo-alpha.iam.gserviceaccount.com/keys/dd05e41cd2077c55c962c9e01f6352f19496b0a0]
module.datarepo-app.google_service_account_key.sql_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-sql@terra-datarepo-alpha.iam.gserviceaccount.com/keys/b27638bf6f8f7b220b1382487176d9f8460faa1d]
module.datarepo-app.google_project_iam_member.sql_sa_role[0]: Refreshing state... [id=terra-datarepo-alpha/roles/cloudsql.client/serviceaccount:datarepo-jade-sql@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.test_runner_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com/keys/e596a28bf46f6806575db7d21a0898d1bdf65d80]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[1]: Refreshing state... [id=terra-datarepo-alpha/roles/logging.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[0]: Refreshing state... [id=terra-datarepo-alpha/roles/container.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[3]: Refreshing state... [id=terra-datarepo-alpha/roles/secretmanager.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.module.workloadid.google_project_iam_member.user-sql-sa-role["alpha"]: Refreshing state... [id=terra-datarepo-alpha/roles/cloudsql.client/serviceaccount:alpha-workload-proxy-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.module.workloadid.google_service_account_iam_binding.sqlproxy_workload_identity_binding["alpha"]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/alpha-workload-proxy-sa@terra-datarepo-alpha.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[2]: Refreshing state... [id=terra-datarepo-alpha/roles/monitoring.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.api_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com/keys/62d19e5653cbd6ddb5851e6273e5b4224f82c2ef]
module.datarepo-app.google_project_iam_member.api_sa_role[9]: Refreshing state... [id=terra-datarepo-alpha/roles/pubsub.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[8]: Refreshing state... [id=terra-datarepo-alpha/roles/storage.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[0]: Refreshing state... [id=terra-datarepo-alpha/roles/bigquery.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[1]: Refreshing state... [id=terra-datarepo-alpha/roles/cloudsql.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[5]: Refreshing state... [id=terra-datarepo-alpha/roles/monitoring.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[10]: Refreshing state... [id=terra-datarepo-alpha/roles/container.admin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[11]: Refreshing state... [id=terra-datarepo-alpha/roles/resourcemanager.projectIamAdmin/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[2]: Refreshing state... [id=terra-datarepo-alpha/roles/datastore.user/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[3]: Refreshing state... [id=terra-datarepo-alpha/roles/errorreporting.writer/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[4]: Refreshing state... [id=terra-datarepo-alpha/roles/logging.logWriter/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[6]: Refreshing state... [id=terra-datarepo-alpha/roles/servicemanagement.serviceController/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[7]: Refreshing state... [id=terra-datarepo-alpha/roles/stackdriver.accounts.viewer/serviceaccount:datarepo-jade-api@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-app.vault_generic_secret.sql_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/alpha/datarepo-sql-sa]
module.datarepo-app.vault_generic_secret.test_runner_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/alpha/test-runner-sa]
module.datarepo-app.vault_generic_secret.api_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/alpha/datarepo-api-sa]
module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0]: Refreshing state... [id=datarepo-db-jade-66b5135b5323955c]
module.datarepo-app.module.cloudsql.google_sql_user.root_user[0]: Refreshing state... [id=root//datarepo-db-jade-66b5135b5323955c]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo-stairway"]: Refreshing state... [id=drmanager//datarepo-db-jade-66b5135b5323955c]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo"]: Refreshing state... [id=drmanager//datarepo-db-jade-66b5135b5323955c]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo"]: Refreshing state... [id=projects/terra-datarepo-alpha/instances/datarepo-db-jade-66b5135b5323955c/databases/datarepo]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo-stairway"]: Refreshing state... [id=projects/terra-datarepo-alpha/instances/datarepo-db-jade-66b5135b5323955c/databases/stairway]
module.datarepo-app.vault_generic_secret.sql_db_password[0]: Refreshing state... [id=secret/dsde/datarepo/alpha/datarepo-sql-db]
module.datarepo-alerts.data.vault_generic_secret.slack_token: Refreshing state... [id=secret/suitable/terraform/stackdriver/slack-token]
module.datarepo-alerts.google_compute_global_address.global_ip_address_prometheus: Refreshing state... [id=projects/terra-datarepo-alpha/global/addresses/datarepo-prometheus-ip]
module.datarepo-alerts.module.uptimecheck.google_monitoring_uptime_check_config.uptime-check-config[0]: Refreshing state... [id=projects/terra-datarepo-alpha/uptimeCheckConfigs/data-alpha-envs-terra-bio]
module.datarepo-alerts.google_compute_global_address.global_ip_address_grafana: Refreshing state... [id=projects/terra-datarepo-alpha/global/addresses/datarepo-grafana-ip]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account.service-account: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0]: Refreshing state... [id=projects/terra-datarepo-alpha/notificationChannels/13640375975922639159]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_key.service-account-key: Refreshing state... [id=projects/terra-datarepo-alpha/serviceAccounts/prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com/keys/fe94124f0f320db237060c852a5c6a78860d960b]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.admin"]: Refreshing state... [id=terra-datarepo-alpha/roles/monitoring.admin/serviceaccount:prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/logging.admin"]: Refreshing state... [id=terra-datarepo-alpha/roles/logging.admin/serviceaccount:prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.metricWriter"]: Refreshing state... [id=terra-datarepo-alpha/roles/monitoring.metricWriter/serviceaccount:prometheus-sa@terra-datarepo-alpha.iam.gserviceaccount.com]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts: Refreshing state... [id=projects/terra-datarepo-alpha/alertPolicies/9870185772218155901]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert: Refreshing state... [id=projects/terra-datarepo-alpha/alertPolicies/8295498595022934880]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util: Refreshing state... [id=projects/terra-datarepo-alpha/alertPolicies/15172991372362375938]
module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0]: Refreshing state... [id=projects/terra-datarepo-alpha/alertPolicies/1005569643174588287]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      ~ data             = (sensitive value)
      ~ data_json        = (sensitive value)
      ~ id               = "secret/suitable/terraform/stackdriver/slack-token" -> (known after apply)
      ~ lease_duration   = 2764800 -> (known after apply)
      + lease_id         = (known after apply)
      ~ lease_renewable  = false -> (known after apply)
      ~ lease_start_time = "RFC3339" -> (known after apply)
        path             = "secret/suitable/terraform/stackdriver/slack-token"
      - version          = -1 -> null
    }

  # module.datarepo-alerts.google_logging_metric.logging_metric_error_connections_exhausted will be created
  + resource "google_logging_metric" "logging_metric_error_connections_exhausted" {
      + filter  = <<~EOT
            resource.type="k8s_container"
            AND labels.k8s-pod/app_kubernetes_io/name="datarepo-api"
            AND resource.labels.project_id="terra-datarepo-alpha"
            AND resource.labels.cluster_name="alpha-master-us-central1"
            AND severity="ERROR"
            AND (jsonPayload.message:"Global exception handler" AND jsonPayload.message:"org.springframework.jdbc.CannotGetJdbcConnectionException")
        EOT
      + id      = (known after apply)
      + name    = "logging/user/metric_error_connections_exhausted"
      + project = (known after apply)

      + metric_descriptor {
          + metric_kind = "DELTA"
          + unit        = "1"
          + value_type  = "INT64"
        }
    }

  # module.datarepo-alerts.google_monitoring_alert_policy.log_based_alert_policy will be created
  + resource "google_monitoring_alert_policy" "log_based_alert_policy" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Error was detected"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/terra-datarepo-alpha/notificationChannels/13640375975922639159",
        ]
      + project               = "terra-datarepo-alpha"

      + conditions {
          + display_name = "Connections Exhausted"
          + name         = (known after apply)

          + condition_threshold {
              + comparison = "COMPARISON_GT"
              + duration   = "60s"
              + filter     = "metric.type=\"logging/user/metric_error_connections_exhausted}\""

              + aggregations {
                  + alignment_period   = "60s"
                  + per_series_aligner = "ALIGN_DELTA"
                }
            }
        }
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
        display_name = "alpha"
        enabled      = true
        id           = "projects/terra-datarepo-alpha/notificationChannels/13640375975922639159"
      ~ labels       = {
          - "auth_token"   = "xoxb-12729891575-1301495169890-SUYNuZWXKWTdFGkT4W07MfGg"
          - "channel_name" = "#jade-alerts"
        } -> (known after apply)
        name         = "projects/terra-datarepo-alpha/notificationChannels/13640375975922639159"
        project      = "terra-datarepo-alpha"
        type         = "slack"
        user_labels  = {}
    }

  # module.core-infrastructure.module.k8s-master.google_container_cluster.cluster must be replaced
+/- resource "google_container_cluster" "cluster" {
      ~ cluster_ipv4_cidr           = "10.127.0.0/20" -> (known after apply)
      + datapath_provider           = (known after apply)
      ~ default_max_pods_per_node   = 110 -> (known after apply)
        enable_binary_authorization = false
        enable_intranode_visibility = false
        enable_kubernetes_alpha     = false
        enable_legacy_abac          = false
        enable_shielded_nodes       = false
        enable_tpu                  = false
      ~ endpoint                    = "34.72.14.91" -> (known after apply)
      ~ id                          = "projects/terra-datarepo-alpha/locations/us-central1/clusters/jade-master-us-central1" -> (known after apply)
        initial_node_count          = 1
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/beta/projects/terra-datarepo-alpha/zones/us-central1-f/instanceGroups/gke-jade-master-us-c-jade-node-us-cen-99143c87-grp",
          - "https://www.googleapis.com/compute/beta/projects/terra-datarepo-alpha/zones/us-central1-b/instanceGroups/gke-jade-master-us-c-jade-node-us-cen-e8c163bb-grp",
          - "https://www.googleapis.com/compute/beta/projects/terra-datarepo-alpha/zones/us-central1-c/instanceGroups/gke-jade-master-us-c-jade-node-us-cen-3d08e79d-grp",
        ] -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
        location                    = "us-central1"
        logging_service             = "logging.googleapis.com/kubernetes"
      ~ master_version              = "1.17.13-gke.2001" -> (known after apply)
        min_master_version          = "1.17.12-gke.1504"
        monitoring_service          = "monitoring.googleapis.com/kubernetes"
      ~ name                        = "jade-master-us-central1" -> "alpha-master-us-central1" # forces replacement
      ~ network                     = "projects/terra-datarepo-alpha/global/networks/alpha-network" -> "alpha-network"
      ~ networking_mode             = "VPC_NATIVE" -> (known after apply)
      ~ node_locations              = [
          - "us-central1-b",
          - "us-central1-c",
          - "us-central1-f",
        ] -> (known after apply)
      ~ node_version                = "1.17.13-gke.2001" -> (known after apply)
      + operation                   = (known after apply)
      ~ project                     = "terra-datarepo-alpha" -> (known after apply)
        remove_default_node_pool    = true
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1beta1/projects/terra-datarepo-alpha/locations/us-central1/clusters/jade-master-us-central1" -> (known after apply)
      ~ services_ipv4_cidr          = "10.0.16.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/terra-datarepo-alpha/regions/us-central1/subnetworks/alpha-subnet" -> "alpha-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)

      ~ addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + config_connector_config {
              + enabled = (known after apply)
            }

          + dns_cache_config {
              + enabled = (known after apply)
            }

          + gce_persistent_disk_csi_driver_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          ~ istio_config {
                disabled = true
            }

          + kalm_config {
              + enabled = (known after apply)
            }

            network_policy_config {
                disabled = false
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      ~ cluster_autoscaling {
          ~ autoscaling_profile = "BALANCED" -> (known after apply)
          ~ enabled             = false -> (known after apply)

          + auto_provisioning_defaults {
              + min_cpu_platform = (known after apply)
              + oauth_scopes     = (known after apply)
              + service_account  = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      ~ cluster_telemetry {
          ~ type = "ENABLED" -> (known after apply)
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      ~ database_encryption {
          + key_name = (known after apply)
          ~ state    = "DECRYPTED" -> (known after apply)
        }

      ~ default_snat_status {
          ~ disabled = false -> (known after apply)
        }

      ~ ip_allocation_policy {
          ~ cluster_ipv4_cidr_block       = "10.127.0.0/20" -> (known after apply)
            cluster_secondary_range_name  = "pods"
          ~ services_ipv4_cidr_block      = "10.0.16.0/20" -> (known after apply)
            services_secondary_range_name = "services"
        }

      ~ master_auth {
          ~ client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMyekNDQWNPZ0F3SUJBZ0lSQU5zZkNSbWxtT3ZKZlpSSFdlZVNuV1F3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa09XWXdaVEF5TmpVdE1UaGhaQzAwWVRRM0xXSmtOVFl0WldaalpqQmpZbVEwTkdJMQpNQjRYRFRJd01EY3lPVEl3TkRnd09Gb1hEVEkxTURjeU9ESXdORGd3T0Zvd0VURVBNQTBHQTFVRUF4TUdZMnhwClpXNTBNSUlCSWpBTkJna3Foa2lHOXcwQkFRRUZBQU9DQVE4QU1JSUJDZ0tDQVFFQTB2Vk9IUklPZVh6N1RFeE4KRHVWdlFvQlFHSno1bklLTjNVajZFQjQ5Z0tLeEZQZDBKY1NaYVo1RitVc0t5ZlNpY0tzNG9oK3ViK1JpMXhNcwpUUWJmcEZ2WDJVWFpwZkE3bldnT0o5eHRtMnhTWFBoRk5ydXFzTnBORlZzSjNuV0d6THB2YmZPN0poZW1YdU9YCnVnTlFOVEZCRUFPM1BrYmlqUk85anFlQkRKNjJTSGJQQ0doSDZrMFY4RER6Rm4xOVpWdFJBL1RjV0xxVTMvaW8KWDM0VGhSbDRsY2lqOWJCSXdCRnFXMlRVQnJKM0E0cmozSWl5VklLc2QzeEFSSEhmWUhOZkdUcVlSbDU2WDh1NQo0aUtiek5XeHR2SVJ3Qi9xRklMcEd3S0VmN2JVeFhYOG85dGN3VjZMdlFsOHRhWmtsMGNweXlJSzRxL0kxSTB4CjBpdGRld0lEQVFBQm94QXdEakFNQmdOVkhSTUJBZjhFQWpBQU1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQmMKeGNPWm1VWk9qYWhqOWdBTXF2K2x0bWhjSUMxYzhFak5nWTJnck5nTjFxUU5TOW4zNnlIYy9xRllJOWlaSC9LQQphTmxzUEF0YVNRd1lMcy80dm5pWkZCS3l4QVVHVmlxbDFiSjh5eDlLb04zTmxCQnhJR3ZwYzhHRGxGSmpiZERaCjVPQTNzZTl4eGFKVzR2cjE4R2ppbHU3Q3lJV1BHNGlteE5Qbk4xUnhCYjM5V0tHd1BXeWg4WGs2aXJJc3UyNE8Kb0RnZVdGVWtFSHlaWVFhcWdDWVhTZzEwaTQ2eGJZV29OVjNhYzc5MUYzMHprNlgwelh4T3h5Slc0SFIzRGllSwpUTGtSYkZNYUE3STI2WllQMFVaM0Y3d0E1c2JlMlNWZWNVUWlERmg4OEFFNU1xbFlLcE1ybHFnelhQUTVaWFZECjBwRU92cTZ4L1VGajdWcnIrb0kxCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)
          ~ client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURDekNDQWZPZ0F3SUJBZ0lRTGwzS0RXRUNCQ1QxTDRMWlkrclhjREFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlRNVpqQmxNREkyTlMweE9HRmtMVFJoTkRjdFltUTFOaTFsWm1ObU1HTmlaRFEwWWpVdwpIaGNOTWpBd056STVNVGswT0RBM1doY05NalV3TnpJNE1qQTBPREEzV2pBdk1TMHdLd1lEVlFRREV5UTVaakJsCk1ESTJOUzB4T0dGa0xUUmhORGN0WW1RMU5pMWxabU5tTUdOaVpEUTBZalV3Z2dFaU1BMEdDU3FHU0liM0RRRUIKQVFVQUE0SUJEd0F3Z2dFS0FvSUJBUUN4dkpFZzA4NEM5NThhZnppNS9aY2NKeDdNUEM4cUs1MWJtcVd2NG9TbAp4cWRoMjIza0pRQ3JQeVdpSmlGWWtCaVNzTnhWaTZZaTcvdko5SDc0SENBdEl6RGM4NjFZS0xGTlpPTm1Ua1ZwClNwZCtXcnBabkFTSkhHTTNZcVpSSjJwZEJMYW5kektsYXY4cnNoZzJHM1JGMEJCMnFQMWN6N3VxcDR3blMza3kKN1h0cDN3TDkyNlVWTFV2QUkydlpmWXNZVzd4TGFRdDJ3ekVhU0dJSGNWcFRHanhYU25RSUxGU05BOFdOWTgvNwpDV09CTW5EeXRoZVpSa2tCUklPa1ZCYzZYd3J5VVhhejZqZkc0OTBtL0VMM3FJMzNyTU00VCtWaDdPNndWZWtKClNYN2c3elhxTE1sRU9LVDZxbDRqNE02K2FkU1VFVDNrb0pkZWZQb243KzFoQWdNQkFBR2pJekFoTUE0R0ExVWQKRHdFQi93UUVBd0lDQkRBUEJnTlZIUk1CQWY4RUJUQURBUUgvTUEwR0NTcUdTSWIzRFFFQkN3VUFBNElCQVFBaQo5bXpobG1wdjZVanBTTVBRNFJ2SUtnM25objlRZm9TSHI0VkJkdzZ4SGpnT2FoNzJ6dDRmMnlGL3VRTW1IY2YwCkVHUlRKbFk2bVZsMTBwTXZiRTdUYVVkSjJCQmdMWmpMbTl0M3lENGtXZnVUMDRLS0g5RHVsVnpjWmRhSU9UMVoKQ2t1N251U2VYRHJhek9WQytrOHlBODJYK1oxaHMybVR4VWMrYW5RdWZuem5vZU5BVWU3UXY2d0Q0UmlBNFFOVAp6M2RCLzVESEFnbFlWSWlXU29RUkVTUnV3WlFDUkx3RU4wWkFNK1JoY3pxZnBuWXE0TXhjVDBWdHJxMy9xdCtBCjE5NzN5R1Nubk81QzAzTHVkS0VoY3BuNzVUY1laQnhkdm9zb0kzRmJhbTc4M1lZUTF6T3VpN0Q1RDRWNHhOZXoKKzAvQ3dHaTFGVjZCMDBzZndrQmsKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)

            client_certificate_config {
                issue_client_certificate = true
            }
        }

        master_authorized_networks_config {
            cidr_blocks {
                cidr_block = "34.68.105.207/32"
            }
            cidr_blocks {
                cidr_block = "35.184.212.129/32"
            }
            cidr_blocks {
                cidr_block = "69.173.112.0/21"
            }
            cidr_blocks {
                cidr_block = "69.173.120.0/22"
            }
            cidr_blocks {
                cidr_block = "69.173.124.0/23"
            }
            cidr_blocks {
                cidr_block = "69.173.126.0/24"
            }
            cidr_blocks {
                cidr_block = "69.173.127.0/25"
            }
            cidr_blocks {
                cidr_block = "69.173.127.128/26"
            }
            cidr_blocks {
                cidr_block = "69.173.127.192/27"
            }
            cidr_blocks {
                cidr_block = "69.173.127.224/30"
            }
            cidr_blocks {
                cidr_block = "69.173.127.228/32"
            }
            cidr_blocks {
                cidr_block = "69.173.127.230/31"
            }
            cidr_blocks {
                cidr_block = "69.173.127.232/29"
            }
            cidr_blocks {
                cidr_block = "69.173.127.240/28"
            }
            cidr_blocks {
                cidr_block = "69.173.64.0/19"
            }
            cidr_blocks {
                cidr_block = "69.173.96.0/20"
            }
        }

      ~ network_policy {
            enabled = true
        }

      ~ node_config {
          + boot_disk_kms_key = (known after apply)
          ~ disk_size_gb      = 50 -> (known after apply)
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS" -> (known after apply)
          ~ labels            = {
              - "environment" = "jade"
              - "project"     = "terra-datarepo-alpha"
            } -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "n1-standard-2" -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints"         = "true"
              - "google-compute-enable-virtio-rng" = "false"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/compute",
              - "https://www.googleapis.com/auth/devstorage.read_only",
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
            ] -> (known after apply)
          ~ preemptible       = false -> (known after apply)
          ~ service_account   = "default" -> (known after apply)
          ~ tags              = [
              - "terra-datarepo-alpha",
              - "jade",
              - "kubernetes",
            ] -> (known after apply)
          ~ taint             = [] -> (known after apply)

          + kubelet_config {
              + cpu_cfs_quota        = (known after apply)
              + cpu_cfs_quota_period = (known after apply)
              + cpu_manager_policy   = (known after apply)
            }

          + linux_node_config {
              + sysctls = (known after apply)
            }

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

          ~ workload_metadata_config {
              ~ node_metadata = "GKE_METADATA_SERVER" -> (known after apply)
            }
        }

      ~ node_pool {
          ~ initial_node_count  = 1 -> (known after apply)
          ~ instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/terra-datarepo-alpha/zones/us-central1-f/instanceGroupManagers/gke-jade-master-us-c-jade-node-us-cen-99143c87-grp",
              - "https://www.googleapis.com/compute/v1/projects/terra-datarepo-alpha/zones/us-central1-b/instanceGroupManagers/gke-jade-master-us-c-jade-node-us-cen-e8c163bb-grp",
              - "https://www.googleapis.com/compute/v1/projects/terra-datarepo-alpha/zones/us-central1-c/instanceGroupManagers/gke-jade-master-us-c-jade-node-us-cen-3d08e79d-grp",
            ] -> (known after apply)
          ~ max_pods_per_node   = 110 -> (known after apply)
          ~ name                = "jade-node-us-central-1" -> (known after apply)
          + name_prefix         = (known after apply)
          ~ node_count          = 1 -> (known after apply)
          ~ node_locations      = [
              - "us-central1-b",
              - "us-central1-c",
              - "us-central1-f",
            ] -> (known after apply)
          ~ version             = "1.17.13-gke.2001" -> (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          ~ management {
              ~ auto_repair  = true -> (known after apply)
              ~ auto_upgrade = true -> (known after apply)
            }

          ~ node_config {
              + boot_disk_kms_key = (known after apply)
              ~ disk_size_gb      = 50 -> (known after apply)
              ~ disk_type         = "pd-standard" -> (known after apply)
              ~ guest_accelerator = [] -> (known after apply)
              ~ image_type        = "COS" -> (known after apply)
              ~ labels            = {
                  - "environment" = "jade"
                  - "project"     = "terra-datarepo-alpha"
                } -> (known after apply)
              ~ local_ssd_count   = 0 -> (known after apply)
              ~ machine_type      = "n1-standard-2" -> (known after apply)
              ~ metadata          = {
                  - "disable-legacy-endpoints"         = "true"
                  - "google-compute-enable-virtio-rng" = "false"
                } -> (known after apply)
              + min_cpu_platform  = (known after apply)
              ~ oauth_scopes      = [
                  - "https://www.googleapis.com/auth/compute",
                  - "https://www.googleapis.com/auth/devstorage.read_only",
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                ] -> (known after apply)
              ~ preemptible       = false -> (known after apply)
              ~ service_account   = "default" -> (known after apply)
              ~ tags              = [
                  - "terra-datarepo-alpha",
                  - "jade",
                  - "kubernetes",
                ] -> (known after apply)
              ~ taint             = [] -> (known after apply)

              + kubelet_config {
                  + cpu_cfs_quota        = (known after apply)
                  + cpu_cfs_quota_period = (known after apply)
                  + cpu_manager_policy   = (known after apply)
                }

              + linux_node_config {
                  + sysctls = (known after apply)
                }

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              ~ shielded_instance_config {
                  ~ enable_integrity_monitoring = true -> (known after apply)
                  ~ enable_secure_boot          = false -> (known after apply)
                }

              ~ workload_metadata_config {
                  ~ node_metadata = "GKE_METADATA_SERVER" -> (known after apply)
                }
            }

          ~ upgrade_settings {
              ~ max_surge       = 1 -> (known after apply)
              ~ max_unavailable = 0 -> (known after apply)
            }
        }

      + notification_config {
          + pubsub {
              + enabled = (known after apply)
              + topic   = (known after apply)
            }
        }

        pod_security_policy_config {
            enabled = true
        }

      ~ private_cluster_config {
          - enable_private_endpoint = false -> null
            enable_private_nodes    = true
            master_ipv4_cidr_block  = "10.227.0.0/28"
          ~ peering_name            = "gke-ncbdde17eed92ea93859-0fc6-5ce8-peer" -> (known after apply)
          ~ private_endpoint        = "10.227.0.2" -> (known after apply)
          ~ public_endpoint         = "34.72.14.91" -> (known after apply)

          + master_global_access_config {
              + enabled = (known after apply)
            }
        }

        release_channel {
            channel = "REGULAR"
        }

        workload_identity_config {
            identity_namespace = "terra-datarepo-alpha.svc.id.goog"
        }
    }

  # module.core-infrastructure.module.k8s-nodes["jade-node-us-central-1"].google_container_node_pool.pool must be replaced
+/- resource "google_container_node_pool" "pool" {
      ~ cluster             = "jade-master-us-central1" -> "alpha-master-us-central1" # forces replacement
      ~ id                  = "projects/terra-datarepo-alpha/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-1" -> (known after apply)
      ~ initial_node_count  = 1 -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/terra-datarepo-alpha/zones/us-central1-f/instanceGroupManagers/gke-jade-master-us-c-jade-node-us-cen-99143c87-grp",
          - "https://www.googleapis.com/compute/v1/projects/terra-datarepo-alpha/zones/us-central1-b/instanceGroupManagers/gke-jade-master-us-c-jade-node-us-cen-e8c163bb-grp",
          - "https://www.googleapis.com/compute/v1/projects/terra-datarepo-alpha/zones/us-central1-c/instanceGroupManagers/gke-jade-master-us-c-jade-node-us-cen-3d08e79d-grp",
        ] -> (known after apply)
        location            = "us-central1"
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "jade-node-us-central-1"
      + name_prefix         = (known after apply)
        node_count          = 1
      ~ node_locations      = [
          - "us-central1-b",
          - "us-central1-c",
          - "us-central1-f",
        ] -> (known after apply)
      ~ project             = "terra-datarepo-alpha" -> (known after apply)
      ~ version             = "1.17.13-gke.2001" -> (known after apply)

        management {
            auto_repair  = true
            auto_upgrade = true
        }

      ~ node_config {
            disk_size_gb      = 50
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
            image_type        = "COS"
            labels            = {
                "environment" = "jade"
                "project"     = "terra-datarepo-alpha"
            }
          ~ local_ssd_count   = 0 -> (known after apply)
            machine_type      = "n1-standard-2"
            metadata          = {
                "disable-legacy-endpoints"         = "true"
                "google-compute-enable-virtio-rng" = "false"
            }
            oauth_scopes      = [
                "https://www.googleapis.com/auth/compute",
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
            ]
            preemptible       = false
          ~ service_account   = "default" -> (known after apply)
            tags              = [
                "terra-datarepo-alpha",
                "jade",
                "kubernetes",
            ]
          ~ taint             = [] -> (known after apply)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

            workload_metadata_config {
                node_metadata = "GKE_METADATA_SERVER"
            }
        }

      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
    }

Plan: 4 to add, 1 to change, 2 to destroy.

Warning: Interpolation-only expressions are deprecated

  on modules/datarepo-app/cloudsql.tf line 25, in module "cloudsql":
  25:     "${local.service}" = {

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 5 more similar warnings elsewhere)


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @nmalfroy, Action: `pull_request`, Working Directory: `./datarepo`, Workflow: `Terraform Plan`*